#+title: Match Me if you can: Swift Pattern Matching in Detail.
#+tags: swift ios cocoa
#+keywords: feature lisp swift optional scala simple optionals switch chaining for pattern matching clojure haskell
#+description: In this post, we'll have a look at Pattern Matching in Swift in terms of the 'switch', 'for', 'if', and 'guard' keywords. We'll have a look at the basic syntax and at best practices and helpful examples.

Among the new features that Swift offers to Objective-C programmers is one that disguises itself like a boring old man while it offers huge potential for forming elegant solutions to otherwise unwieldy sets of nested branches. I'm, of course talking about the =switch= statement that many Objective-C programmers probably consider as a clunky syntax device which is most entertaining when used as [[http://en.wikipedia.org/wiki/Duff's_device][Duff's Device]], yet usually offers little to no advantages over multiple if statements.

The =Switch= statement in Swift can do much more though. In the following tutorial, I will try to explain the various usages for these new features in more detail. I'll mostly ignore those solutions where there's no benefit over how =switch= works in Objective-C or C. The basics of this post were actually written in July 2014, but so many of my patterns crashed the compiler back then that I postponed writing it until there's better support.

This Blog Post is also available in the following languages:

- [[http://qiita.com/mono0926/items/f2875a9eacef53e88122][Japanese]] (Thanks to [[https://twitter.com/_mono][M Ono]]!)

** First Draft

#+BEGIN_SRC swift :noweb-ref tenum1
enum Trades {
    case Buy(stock: String, amount: Int, stockPrice: Float)
    case Sell(stock: String, amount: Int, stockPrice: Float)
}
#+END_SRC

You were also handed the following API to handle trades. *Notice how sell orders are just negative amounts*. And you're told the stock price is not important, their engine will take an internal one anyway.

#+BEGIN_SRC swift :noweb-ref tprocess1
/**
 - parameter stock: The stock name
 - parameter amount: The amount, negative number = sell, positive = buy
*/
func process(stock: String, _ amount: Int) {
    print ("\(amount) of \(stock)")
}
#+END_SRC

The next step is to process those trades. You see the potential for using pattern matching and write this:

#+BEGIN_SRC swift :noweb strip-export
<<tenum1>>
<<tprocess1>>
let aTrade = Trades.Buy(stock: "APPL", amount: 200, stockPrice: 115.5)

switch aTrade {
case .Buy(let stock, let amount, _):
    process(stock, amount)
case .Sell(let stock, let amount, _):
    process(stock, amount * -1)
}
// Prints "buy 200 of APPL"
#+END_SRC

#+RESULTS:
: 200 of APPL

Swift lets us conveniently only destructure / extract the information from the =enum= that we really want. In this case only the stock and the amount.

Awesome, you visit Wall Street to show of your fantastic trading platform. However, as always, the reality is much more cumbersome than the beautiful theory. Trades aren't trades you learn. 

- You have to calculate in a fee which is different based on the trader type. 
- The smaller the institution the higher the fee. 
- Also, bigger institutions get a higher priority. 

They also realized that you'll need a new API for this, so you were handed this:

#+BEGIN_SRC swift :noweb-ref tprocess2
func processSlow(stock: String, _ amount: Int, _ fee: Float) { print("slow") }
func processFast(stock: String, _ amount: Int, _ fee: Float) { print("fast") }
#+END_SRC

** 1. Wildcard Pattern

The wildcard pattern ignores the value to be matched against. In this case any value is possible. This is the same pattern as =let _ = fn()= where the =_= indicates that you don't wish to further use this value. The interesting part is that this matches all values including =nil= [fn:: Think of it like the =*= wildcard you use in the shell]. You can even match optionals by appending a =?=:

#+BEGIN_SRC swift
let p: String? = nil
switch p {
case _?: print ("Has String")
case nil: print ("No String")
}
#+END_SRC 

#+RESULTS:
: No String

As you've seen in the trading example, it also allows you to omit the data you don't need from matching =enums= or =tuples=:

#+BEGIN_SRC swift
switch (15, "example", 3.14) {
    case (_, _, let pi): print ("pi: \(pi)")
}
#+END_SRC

#+RESULTS:
: pi: 3.14

** 2. Identifier Pattern

Matches a concrete value. This is how things work in Objective-C's =switch= implementation:

#+BEGIN_SRC swift
switch 5 {
  case 5: print("5")
}
#+END_SRC

#+RESULTS:
: 5

** 3. Value-Binding Pattern

This is the very same as binding values to variables via =let= or =var=. Only in a switch statement. You've already seen this before, so I'll provide a very short example:

#+BEGIN_SRC swift
switch (4, 5) {
  case let (x, y): print("\(x) \(y)")
}
#+END_SRC

#+RESULTS:
: 4 5

** 5. Enumeration Case Pattern

As you saw in our trading example, pattern matching works *really great* with Swift's =enums=. That's because =enum cases= are like sealed, immutable, destructable structs. Much like with =tuples=, you can unwrap the contents of an individual case right in the match and only extract the information you need [fn:: I'm not sure whether the compiler optimizes for this, but theoretically, it should be able to calculate the correct position of the requested data and inline the address ignoring the other parts of the enum case].

Imagine you're writing a game in a functional style and you have a couple of entities that you need to define. You could use =structs= but as your entities will have very little state, you feel that that's a bit of an overkill.

#+BEGIN_SRC swift :noweb-ref entt
enum Entities {
    case Soldier(x: Int, y: Int)
    case Tank(x: Int, y: Int)
    case Player(x: Int, y: Int)
}
#+END_SRC

Now you need to implement the drawing loop. Here, we only need the X and Y position:

#+BEGIN_SRC swift :exports none :noweb-ref entfun
func entities() -> [Entities] {
    return [Entities.Soldier(x: 0, y: 0)]
}
func drawImage(p: String, _ x: Int, _ y: Int) {
    print (p)
}
#+END_SRC

#+BEGIN_SRC swift :noweb strip-export
<<entt>>
<<entfun>>
for e in entities() {
    switch e {
    case let .Soldier(x, y):
      drawImage("soldier.png", x, y)
    case let .Tank(x, y):
      drawImage("tank.png", x, y)
    case let .Player(x, y):
      drawImage("player.png", x, y)
    }
}
#+END_SRC

#+RESULTS:
: soldier.png

** Type Matches

Given Swift's strong type system, there's usually no need for runtime type checks like it more often happens in Objective-C. However, when you interact with legacy Objective-C code [[https://netguru.co/blog/objective-c-generics][(which hasn't been updated to reflect simple generics yet)]], then you often end up with code that needs to check for types. Imagine getting an array of NSStrings and NSNumbers:

#+BEGIN_SRC swift :noweb-ref nstest1 :prologue "import Cocoa"
let u = NSArray(array: [NSString(string: "String1"), NSNumber(int: 20), NSNumber(int: 40)])
#+END_SRC

When you go through this NSArray, you never know what kind of type you get. However, =switch= statements allow you to easily test for types here:

#+BEGIN_SRC swift :noweb strip-export :prologue "import Cocoa"
<<nstest1>>
for x in u {
    switch x {
    case _ as NSString:
        print("string")
    case _ as NSNumber:
        print("number")
    default:
        print("Unknown types")
    }
}
#+END_SRC

#+RESULTS:
: string
: number
: number

** Word Frequencies

We have a sequence of pairs, each representing a word and its frequency in some text. Our goal is to filter out those pairs whose frequency is below or above a certain threshold, and then only return the remaining words, without their respective frequencies. 

Here're our words:

#+BEGIN_SRC swift :noweb-ref tfreq1
let wordFreqs = [("k", 5), ("a", 7), ("b", 3)]
#+END_SRC

A simple solution would be to model this with =map= and =filter=:

#+BEGIN_SRC swift :noweb strip-export
<<tfreq1>>
let res = wordFreqs.filter({ (e) -> Bool in
    if e.1 > 3 {
        return true
    } else {
        return false
    }
}).map { $0.0 }
print(res)
#+END_SRC

#+RESULTS:
: [k, a]

However, with =flatmap= a map that only returns the non-nil elements, we can improve a lot upon this solution. First and foremost, we can get rid of the =e.1= and instead have proper destructuring by utilizing (you guessed it) tuples. And then, we only need one call =flatmap= instead of =filter= and then =map= which adds unnecessary performance overhead.

#+BEGIN_SRC swift :noweb strip-export
<<tfreq1>>
let res = wordFreqs.flatMap { (e) -> String? in
    switch e {
    case let (s, t) where t > 3: return s
    default: return nil
    }
}
print(res)
#+END_SRC

#+RESULTS:
: [k, a]

** Fibonacci

Also, see how beautiful an implementation of the fibonacci algorithm looks with pattern matching [fn:: of course, no match for a Haskell implementation: \\
fib 0 = 0\\
fib 1 = 1\\
fib n = fib (n-1) + fib (n-2)]

#+BEGIN_SRC swift
func fibonacci(i: Int) -> Int {
    switch(i) {
    case let n where n <= 0: return 0
    case 0, 1: return 1
    case let n: return fibonacci(n - 1) + fibonacci(n - 2)
    }
}

print(fibonacci(8))
#+END_SRC

#+RESULTS:
: 21

Of course, this will kill your stack with big numbers.

** Legacy API and Value Extractions

Oftentimes, when you get data from an external source, like a library, or an API, it is not only good practige but usually even required that you check the data for consistency before interpreting it. You need to make sure that all keys exists or that the data is of the correct type, or the arrays have the required length. Not doing so can lead from buggy behaviour (missing key) to crash of the app (indexing non-existent array items). The classic way to do this is by nesting =if= statements. 

Let's imagine an API that returns a user. However, there're two types of users: System users - like the administrator, or the postmaster - and local users - like "John B", "Bill Gates", etc. Due to the way the system was designed and grew, there're a couple of nuisances that API consumers have to deal with:
- =system= and =local= users come via the same API call.
- the =department= key may not exist, since early versions of the db did not have that field and early employees never had to fill it out.
- the =name= array contains either 4 items (username, middlename, lastname, firstname) or 2 items (full name, username) depending on when the user was created.
- the =age= is an Integer with the age of the user

Our system needs to create user accounts for all system users from this API with only the following information: username, department. We only need users born before 1980. If no department is given, "Corp" is assumed.
  
#+BEGIN_SRC swift :noweb-ref legacyapi 
func legacyAPI(id: Int) -> [String: AnyObject] {
    return ["type": "system", "department": "Dark Arts", "age": 57, 
           "name": ["voldemort", "Tom", "Marvolo", "Riddle"]] 
}
#+END_SRC

#+BEGIN_SRC swift :exports none :noweb-ref grrr
func createSystemUser(b: String, dep: String) {
    print(b, dep)
}
#+END_SRC

#+RESULTS:

Given these constraints, let's develop a pattern match for it:

#+BEGIN_SRC swift :noweb strip-export :prologue "import Foundation"
<<legacyapi>>
<<grrr>>
let item = legacyAPI(4)
switch (item["type"], item["department"], item["age"], item["name"]) {
   case let (sys as String, dep as String, age as Int, name as [String]) where 
      age < 1980 &&
      sys == "system":
     createSystemUser(name.count == 2 ? name.last! : name.first!, dep: dep ?? "Corp")
  default:()
}

// returns ("voldemort", "Dark Arts")
#+END_SRC

#+RESULTS:
: ("voldemort", "Dark Arts")

Note that this code makes one dangerous assumption, which is that if the name array does not have 2 items, it *must* have 4 items. If that case doesn't hold, and we get a zero item name array, this would crash. 

Other than that, it is a nice example of how pattern matching even with just one case can help you write cleaner code and simplify value extractions.

Also, see how we're writing =let= at the beginning right after the case, and don't have to repeat it for each assignment within the case.



